Обработки/Reports/_РасчетМинимальнойДостаточности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасчетМинимальнойДостаточности</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БалансоваяСтоимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДоговораДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СЧА</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РСА</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баланс</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КредиторскаяЗадолженность</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчтенВОтчете</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИтогиПоВидамДоговоров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоговораДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СЧА</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РСА</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Баланс</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КредиторскаяЗадолженность</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасчетМинимальнойДостаточности/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Расчет минимальной достаточности",
		"0.33", 
		"", 
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

#Область ЗаполнитьТабличныеДокументы

Процедура ЗаполнитьТабличныеДокументы(РезультатРасчетМинимальнойСуммыСС, РезультатСЧА, РезультатБалансоваяСтоимостьЮрЛиц, РезультатСтоимостьФЛ) Экспорт
	
	ВызватьИсключение "Эта версия отчёта не используется!";
	
	Отказ = Ложь;
	
	РезультатРасчетМинимальнойСуммыСС.Очистить();
	РезультатСЧА.Очистить();
	РезультатБалансоваяСтоимостьЮрЛиц.Очистить();
	РезультатСтоимостьФЛ.Очистить();
	
	ЗаполнитьДанныеОтчета(Отказ);
	
	Если Отказ Тогда
		ЭтотОбъект.ДанныеОтчета.Очистить();
		Возврат;
	КонецЕсли;
	
#Область РасчетМинимальнойСуммыСС
	
	ДанныеРасчета = Новый Структура("СуммаИФ,СуммаПН,СуммаПР,СуммаЖОВ,СуммаПФР,СуммаИпотПокр,СуммаФизЛица,СуммаЮрЛица,СуммаИтого,СуммаПревышения3млн,РасчетМинРазмераСС,МинРазмерСС");
	
	ОбластьРасчетМинимальнойСуммыСС = ПолучитьМакет("РасчетМинимальнойСуммыСС");
	
	ДанныеРасчета.СуммаИФ		= ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
								+ ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиАкционерныхИнвестиционныхФондов);
								
	ДанныеРасчета.СуммаПН		= ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями);
	ДанныеРасчета.СуммаПР		= ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами);
	ДанныеРасчета.СуммаЖОВ		= ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЖилищногоОбеспеченияВоеннослужащих);
	ДанныеРасчета.СуммаПФР		= ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР);
	ДанныеРасчета.СуммаИпотПокр	= 0; // нет таких
	
	ДанныеРасчета.СуммаФизЛица	= ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица)
								+ ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет);
	
	ДанныеРасчета.СуммаЮрЛица	= ИтогПоВидуДоговораДУ("Баланс", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица)
								+ ИтогПоВидуДоговораДУ("Баланс", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций)
								+ ИтогПоВидуДоговораДУ("Баланс", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ)
								+ ИтогПоВидуДоговораДУ("Баланс", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
								+ ИтогПоВидуДоговораДУ("Баланс", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний)
								+ ИтогПоВидуДоговораДУ("Баланс", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
								+ ИтогПоВидуДоговораДУ("Баланс", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов); 
	
	ДанныеРасчета.СуммаИтого			= ДанныеРасчета.СуммаИФ + ДанныеРасчета.СуммаПН + ДанныеРасчета.СуммаПР + ДанныеРасчета.СуммаЖОВ + ДанныеРасчета.СуммаПФР + ДанныеРасчета.СуммаИпотПокр + ДанныеРасчета.СуммаФизЛица + ДанныеРасчета.СуммаЮрЛица;
	ДанныеРасчета.СуммаПревышения3млн	= ДанныеРасчета.СуммаИтого - 3000000000;
	ДанныеРасчета.РасчетМинРазмераСС	= 20000000 + ДанныеРасчета.СуммаПревышения3млн * 0.0002;
	
	ДанныеРасчета.МинРазмерСС	= Мин(80000000, ДанныеРасчета.РасчетМинРазмераСС);
	
	ЗаполнитьЗначенияСвойств(ОбластьРасчетМинимальнойСуммыСС.Параметры, ДанныеРасчета);
	
	ОбластьРасчетМинимальнойСуммыСС.Параметры.ДатаОтчета = ЭтотОбъект.ДатаОтчета;
	РезультатРасчетМинимальнойСуммыСС.Вывести(ОбластьРасчетМинимальнойСуммыСС);
	
#КонецОбласти

#Область СЧА

	МакетСЧА = ПолучитьМакет("СЧА");
	
	//ПИФ, АИФ
	ОбластьШапкаПИФ = МакетСЧА.ПолучитьОбласть("ШапкаПИФ");
	ОбластьШапкаПИФ.Параметры.СЧА = ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда) + ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиАкционерныхИнвестиционныхФондов);
	ОбластьШапкаПИФ.Параметры.РСА = ИтогПоВидуДоговораДУ("РСА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда) + ИтогПоВидуДоговораДУ("РСА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиАкционерныхИнвестиционныхФондов);
	
	РезультатСЧА.Вывести(ОбластьШапкаПИФ);
	
	ВывестиСтроки(МакетСЧА, РезультатСЧА, ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда);
	ВывестиСтроки(МакетСЧА, РезультатСЧА, ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиАкционерныхИнвестиционныхФондов);
	
	//ПФР
	ОбластьШапкаПФР = МакетСЧА.ПолучитьОбласть("ШапкаПФР");
	ОбластьШапкаПФР.Параметры.СЧА = ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР);
	ОбластьШапкаПФР.Параметры.РСА = ИтогПоВидуДоговораДУ("РСА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР);
	
	РезультатСЧА.Вывести(ОбластьШапкаПФР);
	
	ВывестиСтроки(МакетСЧА, РезультатСЧА, ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР);
	
	//ПН
	ОбластьШапкаПН = МакетСЧА.ПолучитьОбласть("ШапкаПН");
	ОбластьШапкаПН.Параметры.СЧА = ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями);
	ОбластьШапкаПН.Параметры.РСА = ИтогПоВидуДоговораДУ("РСА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями);
	
	РезультатСЧА.Вывести(ОбластьШапкаПН);
	
	ВывестиСтроки(МакетСЧА, РезультатСЧА, ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями);
	
	//ПР
	ОбластьШапкаПР = МакетСЧА.ПолучитьОбласть("ШапкаПР");
	ОбластьШапкаПР.Параметры.СЧА = ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами);
	ОбластьШапкаПР.Параметры.РСА = ИтогПоВидуДоговораДУ("РСА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами);
	
	РезультатСЧА.Вывести(ОбластьШапкаПР);
	
	ВывестиСтроки(МакетСЧА, РезультатСЧА, ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами);
	
	//Страховые
	//ОбластьШапкаСтраховые = МакетСЧА.ПолучитьОбласть("ШапкаСтраховые");
	//ОбластьШапкаСтраховые.Параметры.СЧА = ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний);
	//ОбластьШапкаСтраховые.Параметры.РСА = ИтогПоВидуДоговораДУ("РСА", ЭтотОбъект.ДанныеОтчета, Перечисления.УправлениеИмуществомСтраховыхКомпаний);
	
	//РезультатСЧА.Вывести(ОбластьШапкаСтраховые);
	//
	//ВывестиСтроки(МакетСЧА, РезультатСЧА, ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний);
	
	//СРО
	//ОбластьШапкаСРО = МакетСЧА.ПолучитьОбласть("ШапкаСРО");
	//ОбластьШапкаСРО.Параметры.СЧА = ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций);
	//ОбластьШапкаСРО.Параметры.РСА = ИтогПоВидуДоговораДУ("РСА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций);
	
	//РезультатСЧА.Вывести(ОбластьШапкаСРО);
	
	//ВывестиСтроки(МакетСЧА, РезультатСЧА, ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций);
	
	//Итог
	ОбластьИтог					= МакетСЧА.ПолучитьОбласть("Итог");
	ОбластьИтог.Параметры.СЧА	= ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
								+ ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиАкционерныхИнвестиционныхФондов)
								+ ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
								+ ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
								+ ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами);
								//+ ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
								//+ ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций);
	
	ОбластьИтог.Параметры.РСА	= ИтогПоВидуДоговораДУ("РСА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда)
								+ ИтогПоВидуДоговораДУ("РСА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиАкционерныхИнвестиционныхФондов)
								+ ИтогПоВидуДоговораДУ("РСА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПФР)
								+ ИтогПоВидуДоговораДУ("РСА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
								+ ИтогПоВидуДоговораДУ("РСА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами);
								//+ ИтогПоВидуДоговораДУ("РСА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
								//+ ИтогПоВидуДоговораДУ("РСА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций);
	
	РезультатСЧА.Вывести(ОбластьИтог);

#КонецОбласти

#Область БалансоваяСтоимостьЮрЛиц

	МакетБалансоваяСтоимостьЮрЛиц = ПолучитьМакет("БалансоваяСтоимостьЮрЛиц");
	
	ОбластьШапка	= МакетБалансоваяСтоимостьЮрЛиц.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= МакетБалансоваяСтоимостьЮрЛиц.ПолучитьОбласть("Строка");
	ОбластьИтог		= МакетБалансоваяСтоимостьЮрЛиц.ПолучитьОбласть("Итог");
	
	ОбластьШапка.Параметры.ДатаОтчета = Формат(ЭтотОбъект.ДатаОтчета, "ДФ=dd.MM.yy");
	
	РезультатБалансоваяСтоимостьЮрЛиц.Вывести(ОбластьШапка);
	
	ВывестиСтроки(МакетБалансоваяСтоимостьЮрЛиц, РезультатБалансоваяСтоимостьЮрЛиц, ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица);
	ВывестиСтроки(МакетБалансоваяСтоимостьЮрЛиц, РезультатБалансоваяСтоимостьЮрЛиц, ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций);
	ВывестиСтроки(МакетБалансоваяСтоимостьЮрЛиц, РезультатБалансоваяСтоимостьЮрЛиц, ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ);
	ВывестиСтроки(МакетБалансоваяСтоимостьЮрЛиц, РезультатБалансоваяСтоимостьЮрЛиц, ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний);
	ВывестиСтроки(МакетБалансоваяСтоимостьЮрЛиц, РезультатБалансоваяСтоимостьЮрЛиц, ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний);
	ВывестиСтроки(МакетБалансоваяСтоимостьЮрЛиц, РезультатБалансоваяСтоимостьЮрЛиц, ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов);
	ВывестиСтроки(МакетБалансоваяСтоимостьЮрЛиц, РезультатБалансоваяСтоимостьЮрЛиц, ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов);
	
	ОбластьИтог.Параметры.Баланс	= ИтогПоВидуДоговораДУ("Баланс", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЮридическогоЛица)
									+ ИтогПоВидуДоговораДУ("Баланс", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиСаморегулируемыхОрганизаций)
									+ ИтогПоВидуДоговораДУ("Баланс", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФОГФ)
									+ ИтогПоВидуДоговораДУ("Баланс", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеРезервамиСтраховыхКомпаний)
									+ ИтогПоВидуДоговораДУ("Баланс", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеИмуществомСтраховыхКомпаний)
									+ ИтогПоВидуДоговораДУ("Баланс", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
									+ ИтогПоВидуДоговораДУ("Баланс", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиЦелевыхКапиталов);
	
	РезультатБалансоваяСтоимостьЮрЛиц.Вывести(ОбластьИтог);

#КонецОбласти

#Область СтоимостьФЛ

	МакетСтоимостьФЛ = ПолучитьМакет("СтоимостьФЛ");
	
	ОбластьШапка	= МакетСтоимостьФЛ.ПолучитьОбласть("Шапка");
	ОбластьСтрока	= МакетСтоимостьФЛ.ПолучитьОбласть("Строка");
	ОбластьИтог		= МакетСтоимостьФЛ.ПолучитьОбласть("Итог");
	
	РезультатСтоимостьФЛ.Вывести(ОбластьШапка);
	
	ВывестиСтроки(МакетСтоимостьФЛ, РезультатСтоимостьФЛ, ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет);
	ВывестиСтроки(МакетСтоимостьФЛ, РезультатСтоимостьФЛ, ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица);
	
	ОбластьИтог.Параметры.СЧА = ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)
								+ ИтогПоВидуДоговораДУ("СЧА", ЭтотОбъект.ДанныеОтчета, Перечисления.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиФизическогоЛица);
								
	РезультатСтоимостьФЛ.Вывести(ОбластьИтог);
	
#КонецОбласти	

#Область ПроверкаЧтоВсеДоговораПопалиВОтчёт

	ПараметрыПоиска = Новый Структура("УчтенВОтчете", Ложь);
	НайденныеСтроки = ЭтотОбъект.ДанныеОтчета.НайтиСтроки(ПараметрыПоиска);
	
	Если НайденныеСтроки.Количество() > 0 Тогда

		РезультатРасчетМинимальнойСуммыСС.Очистить();
		РезультатСЧА.Очистить();
		РезультатБалансоваяСтоимостьЮрЛиц.Очистить();
		РезультатСтоимостьФЛ.Очистить();
		
		НеУчтенныеВидыДоговоров = ЭтотОбъект.ДанныеОтчета.Скопировать(НайденныеСтроки, "ВидДоговораДоверительногоУправления");
		НеУчтенныеВидыДоговоров.Свернуть("ВидДоговораДоверительногоУправления");

		ВызватьИсключение "В отчёте не учтены виды договоров: " + СтрСоединить(НеУчтенныеВидыДоговоров.ВыгрузитьКолонку("ВидДоговораДоверительногоУправления"), ", ") + ". Формирование отчёта невозможно.";
		
	КонецЕсли;
	
#КонецОбласти

	РезультатРасчетМинимальнойСуммыСС.АвтоМасштаб = Ложь;
	РезультатСЧА.АвтоМасштаб = Ложь;
	РезультатБалансоваяСтоимостьЮрЛиц.АвтоМасштаб = Ложь;
	РезультатСтоимостьФЛ.АвтоМасштаб = Ложь;

КонецПроцедуры

Процедура ВывестиСтроки(Макет, Результат, Данные, ВидДоговора)
	
	НайденныеСтроки = Данные.НайтиСтроки(Новый Структура("ВидДоговораДоверительногоУправления", ВидДоговора));
	
	Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
		ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаДанных);
		Результат.Вывести(ОбластьСтрока);
	КонецЦикла;
	
КонецПроцедуры

Функция ИтогПоВидуДоговораДУ(Колонка, Данные, ВидДоговора)

	НайденныеСтроки = Данные.НайтиСтроки(Новый Структура("ВидДоговораДоверительногоУправления", ВидДоговора));
	
	Значение = 0;
	
	Для Каждого СтрокаДанных Из НайденныеСтроки Цикл
		Значение = Значение + СтрокаДанных[Колонка];
		СтрокаДанных.УчтенВОтчете = Истина;
	КонецЦикла;
	
	Возврат Значение;

КонецФункции
	
#КонецОбласти

#Область ЗаполнитьДанныеОтчета

Процедура ЗаполнитьДанныеОтчета(Отказ) Экспорт
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ЗаполнитьДанныеОтчета()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "ДатаОтчета,Организация");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	Данные = РаботаСОтчетами.ДанныеДляРасчетаМинимальнойДостаточности(ЭтотОбъект.Организация, ЭтотОбъект.ДатаОтчета);

	Если Данные <> Неопределено Тогда
		ЭтотОбъект.ДанныеОтчета.Загрузить(Данные);
		ЭтотОбъект.ИтогиПоВидамДоговоров.Загрузить(Данные);
		ЭтотОбъект.ИтогиПоВидамДоговоров.Свернуть("ВидДоговораДоверительногоУправления", "СЧА,РСА,Баланс,КредиторскаяЗадолженность");
	КонецЕсли;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

Функция ПолучитьЗафиксированнуюБалансовуюСтоимость() Экспорт
	
	ЗафиксированнаяБалансоваяСтоимость = Новый ТаблицаЗначений;
	ЗафиксированнаяБалансоваяСтоимость.Колонки.Добавить("Период"						, Новый ОписаниеТипов("Дата"));
	ЗафиксированнаяБалансоваяСтоимость.Колонки.Добавить("СчетДоверительногоУправления"	, Новый ОписаниеТипов("СправочникСсылка.СчетаДоверительногоУправления"));
	ЗафиксированнаяБалансоваяСтоимость.Колонки.Добавить("Сумма"							, Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19,2)));
	
	МакетСДанными = ПолучитьМакет("ЗафиксированнаяБалансоваяСтоимость");
	
	Для НомерСтроки = 2 По МакетСДанными.ВысотаТаблицы Цикл
		НоваяСтрока = ЗафиксированнаяБалансоваяСтоимость.Добавить();
		
		НоваяСтрока.Период							= КонецДня(Дата(МакетСДанными.Область(НомерСтроки, 1, НомерСтроки, 1).Текст));
		НоваяСтрока.СчетДоверительногоУправления	= Справочники.СчетаДоверительногоУправления.ПолучитьСсылку(Новый УникальныйИдентификатор(МакетСДанными.Область(НомерСтроки, 4, НомерСтроки, 4).Текст));
		НоваяСтрока.Сумма							= МакетСДанными.Область(НомерСтроки, 5, НомерСтроки, 5).Текст;
		
	КонецЦикла;
	
	Возврат ЗафиксированнаяБалансоваяСтоимость;
	
КонецФункции
	
#КонецОбласти
